app/controllers/meals_controller.rb

  def index
    meals = Meal.all
---
SELECT "meals".* FROM "meals"

  def show
    begin
      meal = Meal.find(params[:id])
---
SELECT  "meals".* FROM "meals" WHERE "meals"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

  def create
    begin
      meal = Movie.create(meal_params)
---
INSERT INTO "meals" ("name", "ingredients", "prep", "cooktime", "calories", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "Something new"], ["ingredients", "Stuff"], ["prep", 20], ["cooktime", 40], ["calories", 500], ["created_at", "2019-02-27 15:44:51.839872"], ["updated_at", "2019-02-27 15:44:51.839872"]]

  def update
    begin
      meal = Meal.find(params[:id])
      meal.update_attributes(meal_params)
---
SELECT  "meals".* FROM "meals" WHERE "meals"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "meals" SET "name" = $1, "ingredients" = $2, "prep" = $3, "cooktime" = $4, "calories" = $5, "updated_at" = $6 WHERE "meals"."id" = $7  [["name", "Test"], ["ingredients", "Test"], ["prep", 50], ["cooktime", 30], ["calories", 200], ["updated_at", "2019-02-27 15:45:51.214886"], ["id", 5]]

  def destroy
    Meal.destroy(params[:id])
---
DELETE FROM "meals" WHERE "meals"."id" = $1  [["id", 5]]