app/controllers/workouts_controller.rb

  def index
    workouts = Workout.all
---
SELECT "workouts".* FROM "workouts"

  def show
    begin
      workout = Workout.find(params[:id])
---
SELECT  "workouts".* FROM "workouts" WHERE "workouts"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

  def create
    begin
      workout = Workout.create(workout_params)
---
INSERT INTO "workouts" ("activity", "description", "duration", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["activity", "Some shiiiiiiiit"], ["description", "Test test test"], ["duration", 40], ["created_at", "2019-02-27 16:35:45.769412"], ["updated_at", "2019-02-27 16:35:45.769412"]]

  def update
    begin
      workout = Workout.find(params[:id])
      workout.update_attributes(workout_params)
---
SELECT  "workouts".* FROM "workouts" WHERE "workouts"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "workouts" SET "activity" = $1, "description" = $2, "duration" = $3, "updated_at" = $4 WHERE "workouts"."id" = $5  [["activity", "Test"], ["description", "Fakeeeeeee"], ["duration", 30], ["updated_at", "2019-02-27 16:38:29.282987"], ["id", 5]]

  def destroy
    Workout.destroy(params[:id])
---
DELETE FROM "workouts" WHERE "workouts"."id" = $1  [["id", 5]]